In [ ]:
import pandas as pd

In [ ]:
#Dataframes= 2D labelled array
info={
    "name": ["robin", "simran", "Rian"],
    "CGPA": [9.8, 8.8, 9.0]
}

df=pd.DataFrame(info)
print(df)

In [ ]:
df

In [10]:
#Series: 1D labelled array
s=pd.Series([1,2,3,4,5])

print(s)

#Two types  of accessing: Indexing and lables
#Indexing
print(s[2])
print(s[4])


#labels: can assign custom labels
age=pd.Series([22, 23, 24, 25, 26], index=["bob", "charlie", "adam", "chloe", "ashley"])

print(age)

#accessing through labels
print(age["adam"])
print(age["bob"])
print(age.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
3
5
bob        22
charlie    23
adam       24
chloe      25
ashley     26
dtype: int64
24
22
Index(['bob', 'charlie', 'adam', 'chloe', 'ashley'], dtype='object')

In [11]:
#series properties
s1=pd.Series([1, 2, 3, 4, 5])
s2=pd.Series([10, 20, 30, 40, 50])

print(s1+s2)

s1[3]=100

print(s1)


changed_s1=s1.drop(2)

print(changed_s1)

print(s1)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0      1
1      2
2      3
3    100
4      5
dtype: int64
0      1
1      2
3    100
4      5
dtype: int64
0      1
1      2
2      3
3    100
4      5
dtype: int64

In [12]:
#Dataframe in detail
info={
    "name":["robin", "simran", "rian"],
    "age":[22,22,1],
    "GPA":[9.0, 9.8, 9.9]    
}

s=pd.DataFrame(info)
print(s)


#accessing rows labels
print(s.index)
print(s.columns)

     name  age  GPA
0   robin   22  9.0
1  simran   22  9.8
2    rian    1  9.9
RangeIndex(start=0, stop=3, step=1)
Index(['name', 'age', 'GPA'], dtype='object')

In [13]:
#creating dataframe with list of list

s=pd.DataFrame([["robin", 22],["simran", 23],["rian", 1]], columns=["name", "age"])

print(s)

     name  age
0   robin   22
1  simran   23
2    rian    1

In [14]:
#creating dataframe array from numpy array
import numpy as np

arr=np.array([[1,2,3],[4,5,6],[7,8,9]])

df=pd.DataFrame(arr, columns=["A", "B", "C"])

print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
#CSV data
df=pd.read_csv("employee_data.csv")

print(df, type(df))

#json data
df1=pd.read_json("employee_data.json", orient="columns")

print(df1, type(df1))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>
   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [41]:
#Dataframes methods

df

df.head()                                          #prints first five values
df.tail()                                          #print last five values
df.tail(2)
df.sample(2)                                        #runs randomly any values
df.info()                                           #summary of our data
df.shape                                          #returns tuples of rows and columns
df.describe()                                       #returns the basic information of the data
df.columns                   
df.nunique()                                        #returns n number of unique rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

In [42]:
#Global Air Quality Data
data=pd.read_csv("globalAirQuality.csv")
print(data)

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
1      2025-11-04 19:25:17.554219      US  New York    40.713    -74.006
2      2025-11-04 20:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
4      2025-11-04 22:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542
17998  2025-11-19 16:25:17.554219      CH    Zurich    47.377      8.542
17999  2025-11-19 17:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
1      32.083   63.043  36.120  4.021  43.536  1.075   90        5.838
2      42.250   82.553  26.935  9.538  23.320  0.977   84       31.833
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
4      21.083   66.423  38.997  6.919  45.615  1.085   97       13.632
...       ...      ...     ...    ...     ...    ...  ...          ...
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951
17998  40.722   95.152  32.957  5.524  53.193  0.868   95       24.042
17999  25.830   30.411  35.317  4.336  66.246  0.848   88        8.529

       humidity  wind_speed
0        70.168       3.725
1        80.088       8.969
2        62.783       9.650
3        89.153       8.956
4        76.499       4.017
...         ...         ...
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660
17998    31.880       2.642
17999    59.104       4.403

[18000 rows x 15 columns]

In [55]:
data

print(data.head(5))
print(data.tail())
print(data.info())
print(data.shape)
print(data.describe())
print(data.columns)
print(data.nunique())
print(data.sample())

                        timestamp country    city  latitude  longitude  \
17995  2025-11-19 13:25:17.554219      CH  Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH  Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH  Zurich    47.377      8.542
17998  2025-11-19 16:25:17.554219      CH  Zurich    47.377      8.542
17999  2025-11-19 17:25:17.554219      CH  Zurich    47.377      8.542

         pm25    pm10     no2    so2      o3     co  aqi  temperature  \
17995  27.899  74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950  47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347  72.908  46.976  5.763  66.492  0.947  122       21.951
17998  40.722  95.152  32.957  5.524  53.193  0.868   95       24.042
17999  25.830  30.411  35.317  4.336  66.246  0.848   88        8.529

       humidity  wind_speed
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660
17998    31.880       2.642
17999    59.104       4.403
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18000 entries, 0 to 17999
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   timestamp    18000 non-null  object
 1   country      18000 non-null  object
 2   city         18000 non-null  object
 3   latitude     18000 non-null  float64
 4   longitude    18000 non-null  float64
 5   pm25         18000 non-null  float64
 6   pm10         18000 non-null  float64
 7   no2          18000 non-null  float64
 8   so2          18000 non-null  float64
 9   o3           18000 non-null  float64
 10  co           18000 non-null  float64
 11  aqi          18000 non-null  int64
 12  temperature  18000 non-null  float64
 13  humidity     18000 non-null  float64
 14  wind_speed   18000 non-null  float64
dtypes: float64(11), int64(1), object(3)
memory usage: 2.1+ MB
None
(18000, 15)
           latitude     longitude          pm25          pm10           no2  \
count  18000.000000  18000.000000  18000.000000  18000.000000  18000.000000
mean      23.065980     37.655560     40.369131     70.152228     32.055176
std       26.156536     78.600701     17.647450     24.999440     13.820680
min      -37.814000   -123.121000      0.025000      0.061000      0.013000
25%       12.972000      2.352000     27.904500     53.125500     22.362500
50%       29.232000     42.146000     40.286500     69.961000     32.019500
75%       41.008000    103.820000     52.436250     87.256500     41.364250
max       60.170000    174.763000    115.683000    161.810000     90.019000

                so2            o3            co           aqi   temperature  \
count  18000.000000  18000.000000  18000.000000  18000.000000  18000.000000
mean       6.035508     48.065100      0.800595    104.645556     21.510251
std        2.454790     14.950849      0.250254     25.616070      9.509444
min        0.003000      0.114000      0.000000     16.000000      5.000000
25%        4.360750     38.028500      0.633000     87.000000     13.357750
50%        6.026000     48.142000      0.800500    103.000000     21.455500
75%        7.715250     58.258500      0.969000    121.000000     29.688250
max       16.559000    103.016000      1.832000    231.000000     37.998000

           humidity    wind_speed
count  18000.000000  18000.000000
mean      57.714351      5.283910
std       18.844908      2.741712
min       25.002000      0.500000
25%       41.320000      2.937000
50%       57.847000      5.297000
75%       74.234750      7.662000
max       89.997000      9.999000
Index(['timestamp', 'country', 'city', 'latitude', 'longitude', 'pm25', 'pm10',
       'no2', 'so2', 'o3', 'co', 'aqi', 'temperature', 'humidity',
       'wind_speed'],
      dtype='object')
timestamp        360
country           38
city              50
latitude          50
longitude         50
pm25           15839
pm10           16332
no2            15139
so2             8158
o3             15275
co              1376
aqi              178
temperature    13930
humidity       15725
wind_speed      8058
dtype: int64
                        timestamp country       city  latitude  longitude  \
17041  2025-11-09 19:25:17.554219      SE  Stockholm    59.329     18.069

         pm25    pm10     no2    so2     o3     co  aqi  temperature  \
17041  31.492  55.813  43.548  7.953  31.24  0.425  108       17.011

       humidity  wind_speed
17041    69.999       9.654

In [81]:
#selecting data
print(data["city"])
print(data[["city", "aqi", "co"]])

print(data.loc[0])                         #accessing row using labels
print(data.iloc[2])                        #accessing row using indexes
#slicing
print(data.loc[2:7])


#getting rows and columns both values
print(data.loc[0, "aqi"])

#or we can multiple values
print(data.loc[1, ["aqi", "temperature"]])
#cannot execute through iloc beacuse it needs the numerical value

#select single scaler value
print(data.at[0, "city"])
print(data.iat[0,5])


#similar as numpy, pandas create view not the copy and if we want to use copy we have to use .copy()

data

0        New York
1        New York
2        New York
3        New York
4        New York
           ...
17995      Zurich
17996      Zurich
17997      Zurich
17998      Zurich
17999      Zurich
Name: city, Length: 18000, dtype: object
           city  aqi     co
0      New York  108  1.096
1      New York   90  1.075
2      New York   84  0.977
3      New York  158  0.230
4      New York   97  1.085
...         ...  ...    ...
17995    Zurich  103  1.028
17996    Zurich  105  0.644
17997    Zurich  122  0.947
17998    Zurich   95  0.868
17999    Zurich   88  0.848

[18000 rows x 3 columns]
timestamp      2025-11-04 18:25:17.554219
country                                US
city                             New York
latitude                           40.713
longitude                         -74.006
pm25                               50.295
pm10                              108.938
no2                                27.998
so2                                 6.539
o3                                 52.568
co                                  1.096
aqi                                   108
temperature                        18.504
humidity                           70.168
wind_speed                          3.725
Name: 0, dtype: object
timestamp      2025-11-04 20:25:17.554219
country                                US
city                             New York
latitude                           40.713
longitude                         -74.006
pm25                                42.25
pm10                               82.553
no2                                26.935
so2                                 9.538
o3                                  23.32
co                                  0.977
aqi                                    84
temperature                        31.833
humidity                           62.783
wind_speed                           9.65
Name: 2, dtype: object
                    timestamp country      city  latitude  longitude    pm25  \
2  2025-11-04 20:25:17.554219      US  New York    40.713    -74.006  42.250
3  2025-11-04 21:25:17.554219      US  New York    40.713    -74.006  30.403
4  2025-11-04 22:25:17.554219      US  New York    40.713    -74.006  21.083
5  2025-11-04 23:25:17.554219      US  New York    40.713    -74.006  31.242
6  2025-11-05 00:25:17.554219      US  New York    40.713    -74.006  77.690
7  2025-11-05 01:25:17.554219      US  New York    40.713    -74.006  57.816

      pm10     no2    so2      o3     co  aqi  temperature  humidity  \
2   82.553  26.935  9.538  23.320  0.977   84       31.833    62.783
3   79.951  63.536  7.609  31.369  0.230  158       23.140    89.153
4   66.423  38.997  6.919  45.615  1.085   97       13.632    76.499
5   92.779  30.633  8.030  43.725  0.347   92       15.159    42.505
6   65.198  20.302  7.641  62.687  0.734  155       36.729    47.651
7  111.709  34.533  6.945  41.304  0.771  115       37.891    53.314

   wind_speed
2       9.650
3       8.956
4       4.017
5       1.199
6       4.542
7       7.605
108
aqi               90
temperature    5.838
Name: 1, dtype: object
New York
50.295

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [86]:
#Filtering data
#Question 1: WAP to get the aqi above than 100

print(data[ data["aqi"] > 100])


#Question 2: WAP to get the aqi above than 100 and temperature above than 30

print(data[ (data["aqi"] >100) & (data["temperature"] > 30)])

print(data[ data["aqi"]> 100] [["city", "aqi"]])

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
6      2025-11-05 00:25:17.554219      US  New York    40.713    -74.006
7      2025-11-05 01:25:17.554219      US  New York    40.713    -74.006
8      2025-11-05 02:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17991  2025-11-19 09:25:17.554219      CH    Zurich    47.377      8.542
17993  2025-11-19 11:25:17.554219      CH    Zurich    47.377      8.542
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
6      77.690   65.198  20.302  7.641  62.687  0.734  155       36.729
7      57.816  111.709  34.533  6.945  41.304  0.771  115       37.891
8      60.914   44.775  40.936  6.779  36.751  1.014  121       24.092
...       ...      ...     ...    ...     ...    ...  ...          ...
17991  52.120   71.160  35.405  7.752  39.811  0.878  104       32.556
17993  76.613   37.495  29.662  5.419  57.042  1.103  153       20.437
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951

       humidity  wind_speed
0        70.168       3.725
3        89.153       8.956
6        47.651       4.542
7        53.314       7.605
8        48.148       8.686
...         ...         ...
17991    31.372       2.787
17993    79.602       2.663
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660

[9721 rows x 15 columns]
                        timestamp country      city  latitude  longitude  \
6      2025-11-05 00:25:17.554219      US  New York    40.713    -74.006
7      2025-11-05 01:25:17.554219      US  New York    40.713    -74.006
14     2025-11-05 08:25:17.554219      US  New York    40.713    -74.006
17     2025-11-05 11:25:17.554219      US  New York    40.713    -74.006
25     2025-11-05 19:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17947  2025-11-17 13:25:17.554219      CH    Zurich    47.377      8.542
17950  2025-11-17 16:25:17.554219      CH    Zurich    47.377      8.542
17975  2025-11-18 17:25:17.554219      CH    Zurich    47.377      8.542
17976  2025-11-18 18:25:17.554219      CH    Zurich    47.377      8.542
17991  2025-11-19 09:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
6      77.690   65.198  20.302  7.641  62.687  0.734  155       36.729
7      57.816  111.709  34.533  6.945  41.304  0.771  115       37.891
14     38.815  121.394  25.969  4.112  44.730  1.124  121       34.481
17     63.552   57.838  13.754  4.427  42.251  0.997  127       36.193
25     56.954   75.045  29.837  9.541  54.198  1.170  113       31.289
...       ...      ...     ...    ...     ...    ...  ...          ...
17947  53.938   75.183  16.255  7.263  67.244  0.457  107       32.584
17950  70.255   60.620  32.081  2.065  47.803  0.852  140       36.885
17975  33.406   98.160  44.654  0.807  45.160  0.737  111       30.761
17976  73.493   89.558   9.313  4.768  51.505  0.745  146       30.909
17991  52.120   71.160  35.405  7.752  39.811  0.878  104       32.556

       humidity  wind_speed
6        47.651       4.542
7        53.314       7.605
14       81.790       3.576
17       62.906       7.097
25       43.279       5.264
...         ...         ...
17947    81.544       7.101
17950    34.173       1.748
17975    76.073       3.570
17976    81.573       1.024
17991    31.372       2.787

[2384 rows x 15 columns]
           city  aqi
0      New York  108
3      New York  158
6      New York  155
7      New York  115
8      New York  121
...         ...  ...
17991    Zurich  104
17993    Zurich  153
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122

[9721 rows x 2 columns]

In [88]:
#query

print(data.query("aqi> 100" )[["city", "country"]])


#in query we can access variables: returns copy
aqi_val=100

print(data.query("aqi> @aqi_val")[["city", "country"]])

           city country
0      New York      US
3      New York      US
6      New York      US
7      New York      US
8      New York      US
...         ...     ...
17991    Zurich      CH
17993    Zurich      CH
17995    Zurich      CH
17996    Zurich      CH
17997    Zurich      CH

[9721 rows x 2 columns]
           city country
0      New York      US
3      New York      US
6      New York      US
7      New York      US
8      New York      US
...         ...     ...
17991    Zurich      CH
17993    Zurich      CH
17995    Zurich      CH
17996    Zurich      CH
17997    Zurich      CH

[9721 rows x 2 columns]

In [103]:
#Data cleaning

#1. Handle missing values
raw_data=pd.read_csv("raw_data.csv")
raw_data.isnull()

#WAP to find the sum of missing values in every column
raw_data.isnull().sum()

#drop the row whose value is missing
raw_data.dropna()

#drop the column whose value is missing
raw_data.dropna(axis=1)


#fill the empty value
raw_data.fillna(0)


#fill the empty value of particular column
age_mean=raw_data["age"].mean()

cleaned_data=raw_data.copy()
age_mean=cleaned_data["age"].mean()

cleaned_data["age"]=cleaned_data["age"].fillna(age_mean)



#forward fill
raw_data.ffill()

#backward fill
raw_data.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [101]:
raw_data

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [108]:
#handling duplicates
raw_data.duplicated()

#drop duplicate
cleaned_data=raw_data.drop_duplicates().copy()               #it will not reflect in the original data

cleaned_data

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [130]:
#data types

#check data type
raw_data.dtypes

cleaned_data=raw_data.copy()
cleaned_data=raw_data.fillna(0)

#change the data type
cleaned_data["age"]=cleaned_data["age"].astype("int64")

cleaned_data.dtypes

#changing type into date time data type
df=pd.Series([pd.to_datetime("12-10-31")])

type(df.dtypes)





data=pd.read_csv("globalAirQuality.csv")

data["timestamp"]=pd.to_datetime(data["timestamp"])

data["timestamp"].dtype


raw_data["gender"].str.lower()
raw_data["gender"].str.upper()

#separate the values
raw_data["name"].str.split(" ")            #on the basis of space and also can do on the basis of anything like @, any letter


#check if any value is present or not
raw_data["country"].str.contains("USA")

#we can check after ignoring cases also
raw_data["country"].str.contains("india", case=False)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object

In [187]:
#Feature engineering

#apply method

data2=raw_data.copy()

data2["tax"]=raw_data["income"].apply(lambda x: "20%" if x>50000 else "10%")




#map method: to replace existing value to new value
gender_map={"Female": "F", "Male": "M", "Unknown": "U"}

df2=raw_data.copy()

df2["gender"]=df2["gender"].map(gender_map)



#assigning methods: creating new columns

df2=df2.assign(new_income=df2["income"]*1.1)




#replace method

df2["country"]=df2["country"].replace("USA", "US")




#renaming all columns

df2.columns=["ID", "NAME", "AGE", "COUNTRY", "GENDER", "INCOME", "NEW_INCOME"]



#rename particular column

df2.rename(columns={"INCOME": "SALARY"})

#change particular row using labels

df2.rename(index={1:"First"})

#sort values according to columns

sorted_data=df2.sort_values("INCOME")


# sorted_data=df2.sort_values("INCOME", ascending=False)

# print(sorted_data)


#sort values acccording to labels

sorted_labels=df2.sort_index

# print(sorted_labels)


#reset
# sorted_data=sorted_data.reset_index()

#drop the auto saving labels

sorted_data=sorted_data.reset_index(drop= True)

# print(sorted_data)


#ranking

sorted_data["RANKING"]= sorted_data["INCOME"].rank(ascending=False, method="max")

# print(sorted_data)


#reorder columns
sorted_data[["ID", "NAME", "AGE", "COUNTRY", "GENDER", "INCOME","RANKING", "NEW_INCOME"]]

    ID          NAME   AGE COUNTRY GENDER   INCOME  RANKING  NEW_INCOME
0    9   Carlos Ruiz   NaN  Mexico      M  45000.0     10.0     49500.0
1    3          Alex   NaN      US      U  47000.0      9.0     51700.0
2    5        Li Wei  27.0   China      M  51000.0      8.0     56100.0
3    1      John Doe  29.0      US      M  55000.0      7.0     60500.0
4    1      John Doe  29.0      US      M  55000.0      7.0     60500.0
5   10   Emily Davis  31.0      US    NaN  58000.0      5.0     63800.0
6    2    Jane Smith   NaN  Canada      F  62000.0      4.0     68200.0
7    8    Rachel Lee  29.0      US      F  62000.0      4.0     68200.0
8    7    Ahmed Khan  38.0     NaN      M  68000.0      2.0     74800.0
9    6           NaN  45.0   India      F  73000.0      1.0     80300.0
10   4  Maria Garcia  34.0   Spain      F      NaN      NaN         NaN

In [189]:
raw_data

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [196]:
#Practice question

#Question: Shift id column to end

shift_data=raw_data[["name", "age", "country", "gender", "income", "id"]]

shift_data


#or we can do with list comprehension
new_col_order=raw_data.copy()

new_col_order=[col for col in raw_data.columns if col!="id"] +["id"]

print(new_col_order)

raw_data[new_col_order]

['name', 'age', 'country', 'gender', 'income', 'id']

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [ ]:
#writing data to json and csv file